In [1]:
import numpy as np
import pandas as pd

In [2]:
L = [1,3,5,7]
pd.Series(L)

0    1
1    3
2    5
3    7
dtype: int64

In [3]:
pd.Series(L, index=['a','b','c','d'])

a    1
b    3
c    5
d    7
dtype: int64

In [5]:
L = {'a':1, 'b':2, 'c':3, 'd':4}
S = pd.Series(L)

In [6]:
S['c']

3

In [8]:
S['g']=100

In [9]:
S

a      1
b      2
c      3
d      4
g    100
dtype: int64

In [10]:
S.index

Index(['a', 'b', 'c', 'd', 'g'], dtype='object')

In [11]:
S.values

array([  1,   2,   3,   4, 100], dtype=int64)

In [12]:
raw_data = {
    'first_name':['jason','molly','tina','jake','any'],
    'last_name':['miller','jacobson','ali','milner','cooze'],
    'age':[42,52,36,24,75],
    'city':['san francisco','baltimore','miami','douglas','boston']
}

In [13]:
raw_data

{'first_name': ['jason', 'molly', 'tina', 'jake', 'any'],
 'last_name': ['miller', 'jacobson', 'ali', 'milner', 'cooze'],
 'age': [42, 52, 36, 24, 75],
 'city': ['san francisco', 'baltimore', 'miami', 'douglas', 'boston']}

In [14]:
df = pd.DataFrame(raw_data)

In [15]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [16]:
pd.DataFrame(raw_data, columns = ['last_name', 'first_name'])

  last_name first_name
0    miller      jason
1  jacobson      molly
2       ali       tina
3    milner       jake
4     cooze        any

In [17]:
df = pd.DataFrame(raw_data)

In [18]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [19]:
df['first_name']

0    jason
1    molly
2     tina
3     jake
4      any
Name: first_name, dtype: object

In [20]:
df[['age','city']]

   age           city
0   42  san francisco
1   52      baltimore
2   36          miami
3   24        douglas
4   75         boston

In [21]:
df

  first_name last_name  age           city
0      jason    miller   42  san francisco
1      molly  jacobson   52      baltimore
2       tina       ali   36          miami
3       jake    milner   24        douglas
4        any     cooze   75         boston

In [22]:
df.index = ['a','b','c','d','e']
df

  first_name last_name  age           city
a      jason    miller   42  san francisco
b      molly  jacobson   52      baltimore
c       tina       ali   36          miami
d       jake    milner   24        douglas
e        any     cooze   75         boston

In [23]:
df.loc['a']

first_name            jason
last_name            miller
age                      42
city          san francisco
Name: a, dtype: object

In [24]:
df.loc['b']

first_name        molly
last_name      jacobson
age                  52
city          baltimore
Name: b, dtype: object

In [25]:
df.loc[['b','c']]

  first_name last_name  age       city
b      molly  jacobson   52  baltimore
c       tina       ali   36      miami